Repository: LuaDist/libpq
Catalog: src/interfaces/libpq/po/*.po
Languages: pl

source: host name must be specified
pl: nazwa hosta musi byæ okre¶lona

source: could not set socket to blocking mode: %s
pl: nie mo¿na ustawiæ gniazda w tryb blokowania: %s

source: Kerberos 5 authentication rejected: %*s
pl: Kerberos 5 autoryzacja odrzucona: %*s

source: could not restore non-blocking mode on socket: %s
pl: nie mo¿na odtworzyæ trybu nieblokowanego gniazda: %s

source: GSSAPI continuation error
pl: b³±d kontynuowania GSSAPI

source: duplicate GSS authentication request
pl: podwójne ¿±danie autoryzacji GSS

source: GSSAPI name import error
pl: b³±d importu nazwy GSSAPI

source: SSPI continuation error
pl: b³±d kontynuowania SSPI

source: out of memory
pl: brak pamiêci

source: could not acquire SSPI credentials
pl: nie mo¿na nabyæ po¶wiadczeñ SSPI

source: SCM_CRED authentication method not supported
pl: Metoda autoryzacji SCM_CRED nie jest dostêpna

source: Kerberos 4 authentication not supported
pl: metoda autoryzacji Kerberos 4 nie jest dostêpna

source: Kerberos 5 authentication not supported
pl: metoda autoryzacji Kerberos 5 nie jest dostêpna

source: GSSAPI authentication not supported
pl: Metoda autoryzacji GSSAPI nie jest dostêpna

source: SSPI authentication not supported
pl: Metoda autoryzacji SSPI nie jest dostêpna

source: Crypt authentication not supported
pl: metoda autoryzacji Crypt nie jest dostêpna

source: authentication method %u not supported
pl: metoda autoryzacji %u nie jest dostêpna

source: invalid sslmode value: "%s"
pl: b³êdna warto¶æ sslmode: "%s"

source: sslmode value "%s" invalid when SSL support is not compiled in
pl: b³êdna warto¶æ sslmode "%s" gdy¿ obs³uga SSL nie zosta³a skompilowana

source: could not set socket to TCP no delay mode: %s
pl: nie mo¿na ustawiæ gniazda TCP w tryb bez opó¼nieñ: %s

source: could not connect to server: %s Is the server running locally and accepting connections on Unix domain socket "%s"?
pl: nie mo¿na po³±czyæ siê z serwerem: %s Czy serwer dzia³a lokalnie i akceptuje po³±czenia przy pomocy gniazd dziedziny uniksa "%s"?

source: could not connect to server: %s Is the server running on host "%s" (%s) and accepting TCP/IP connections on port %s?
pl: nie mo¿na po³±czyæ siê z serwerem: %s Czy serwer dzia³a na serwerze "%s" (%s) i akceptuje po³±czenia TCP/IP na porcie %s?

source: could not connect to server: %s Is the server running on host "%s" and accepting TCP/IP connections on port %s?
pl: nie mo¿na po³±czyæ siê z serwerem: %s Czy serwer dzia³a na stacji sieciowej "%s" i akceptuje po³±czenia TCP/IP na porcie %s?

source: setsockopt(TCP_KEEPIDLE) failed: %s
pl: nie powiod³o siê setsockopt(TCP_KEEPIDLE): %s

source: setsockopt(TCP_KEEPALIVE) failed: %s
pl: nie powiod³o siê setsockopt(TCP_KEEPALIVE): %s

source: setsockopt(TCP_KEEPINTVL) failed: %s
pl: nie powiod³o siê setsockopt(TCP_KEEPINTVL): %s

source: setsockopt(TCP_KEEPCNT) failed: %s
pl: nie powiod³o siê setsockopt(TCP_KEEPCNT): %s

source: WSAIoctl(SIO_KEEPALIVE_VALS) failed: %ui
pl: nie powiod³o siê WSAIoctl(SIO_KEEPALIVE_VALS): %ui

source: invalid port number: "%s"
pl: nieprawid³owy numer portu: "%s"

source: could not translate host name "%s" to address: %s
pl: nie mo¿na przet³umaczyæ nazwy hosta "%s" na adres: %s

source: could not translate Unix-domain socket path "%s" to address: %s
pl: nie mo¿na przet³umaczyæ ¶cie¿ki gniazda Unix-domain "%s" na adres: %s

source: invalid connection state, probably indicative of memory corruption
pl: b³êdny stan po³±czenia, prawdopodobnie oznajmiaj±cy uszkodzenie pamiêci

source: could not create socket: %s
pl: nie mo¿na utworzyæ gniazda: %s

source: could not set socket to non-blocking mode: %s
pl: nie mo¿na ustawiæ gniazda w tryb nieblokuj±cy: %s

source: could not set socket to close-on-exec mode: %s
pl: nie mo¿na ustawiæ gniazda obs³ugi zamkniêcia przy uruchomieniu: %s

source: keepalives parameter must be an integer
pl: parameter keepalives musi byæ liczb± ca³kowit±

source: setsockopt(SO_KEEPALIVE) failed: %s
pl: nie powiod³o siê setsockopt(SO_KEEPALIVE): %s

source: could not get socket error status: %s
pl: nie mo¿na otrzymaæ b³êdu gniazda: %s

source: could not get client address from socket: %s
pl: nie mo¿na otrzymaæ adresu klienta z gniazda: %s

source: requirepeer parameter is not supported on this platform
pl: parametr requirepeer nie jest obs³ugiwany na tej platformie

source: local user with ID %d does not exist
pl: lokalny u¿ytkownik o ID %d nie istnieje

source: requirepeer specifies "%s", but actual peer user name is "%s"
pl: requirepeer wskazuje "%s", ale nazwa bie¿±cego u¿ytkownika równorzêdnego to "%s"

source: could not send SSL negotiation packet: %s
pl: nie mo¿na wys³aæ pakietu negocjacji SSL: %s

source: could not send startup packet: %s
pl: nie mo¿na wys³aæ pakietu rozpoczynaj±cego: %s

source: server does not support SSL, but SSL was required
pl: serwer nie obs³uguje SSL, ale SSL by³o wymagane

source: received invalid response to SSL negotiation: %c
pl: otrzymano niepoprawn± odpowied¼ negocjacji SSL: %c

source: expected authentication request from server, but received %c
pl: oczekiwano pro¶by autoryzacji z serwera ale otrzymano %c

source: out of memory allocating GSSAPI buffer (%i)
pl: brak pamiêci podczas alokacji buforu GSSAPI (%i)

source: unexpected message from server during startup
pl: niespodziewana wiadomo¶æ z serwera podczas startu

source: invalid connection state %d, probably indicative of memory corruption
pl: nieprawid³owy stan po³±czenia %d, prawdopodobnie wskazuj±cy na uszkodzenie pamiêci

source: PGEventProc "%s" failed during PGEVT_CONNRESET event
pl: PGEventProc "%s" zawiod³a podczas zdarzenia PGEVT_CONNRESET

source: invalid LDAP URL "%s": scheme must be ldap://
pl: Niepoprawny adres URL LDAP "%s": schemat musi byæ ldap://

source: invalid LDAP URL "%s": missing distinguished name
pl: niepoprawny adres URL LDAP "%s": brakuj±ca nazwa wyró¿niaj±ca

source: invalid LDAP URL "%s": must have exactly one attribute
pl: niepoprawny adres URL LDAP "%s": musi mieæ dok³adnie jeden atrybut

source: invalid LDAP URL "%s": must have search scope (base/one/sub)
pl: niepoprawny adres URL LDAP "%s": musi mieæ zakres wyszukiwania (base/one/sub)

source: invalid LDAP URL "%s": no filter
pl: niepoprawny adres URL LDAP "%s": brak filtra

source: invalid LDAP URL "%s": invalid port number
pl: niepoprawny adres URL LDAP "%s": niepoprawny numer portu

source: could not create LDAP structure
pl: nie mo¿na utworzyæ struktury LDAP

source: lookup on LDAP server failed: %s
pl: przeszukiwanie LDAP nie powiod³o siê: %s

source: more than one entry found on LDAP lookup
pl: ponad jeden wpis znaleziono podczas przeszukiwania LDAP

source: no entry found on LDAP lookup
pl: nie znaleziono wpisu podczas przeszukiwania LDAP

source: attribute has no values on LDAP lookup
pl: atrybut nie ma warto¶ci w przeszukiwaniu LDAP

source: missing "=" after "%s" in connection info string
pl: brakuj±ce "=" po "%s" w ³añcuchu informacyjnym po³±czenia

source: invalid connection option "%s"
pl: b³êdna opcja po³±czenia "%s"

source: unterminated quoted string in connection info string
pl: niezamkniêty cudzys³ów w ³añcuchu informacyjnym po³±czenia

source: could not get home directory to locate service definition file
pl: nie mo¿na pobraæ katalogu domowego aby zlokalizowaæ plik definicji us³ugi

source: definition of service "%s" not found
pl: nie znaleziono definicji us³ugi "%s"

source: service file "%s" not found
pl: nie znaleziono pliku us³ugi "%s"

source: line %d too long in service file "%s"
pl: zbyt d³uga linia %d w pliku us³ugi "%s"

source: syntax error in service file "%s", line %d
pl: b³±d sk³adni w pliku us³ugi "%s", linia %d

source: connection pointer is NULL
pl: wska¼nik po³±czenia ma warto¶æ NULL

source: WARNING: password file "%s" is not a plain file
pl: OSTRZE¯ENIE: plik has³a "%s" nie jest zwyk³ym plikiem

source: WARNING: password file "%s" has group or world access; permissions should be u=rw (0600) or less
pl: UWAGA: plik has³a "%s" posiada globalne lub grupowe uprawnienia odczytu; uprawniania powinny byæ ustawione na u=rw (0600) lub ni¿ej

source: password retrieved from file "%s"
pl: has³o odczytane z pliku "%s"

source: NOTICE
pl: OSTRZE¯ENIE

source: command string is a null pointer
pl: ³añcuch polecenia jest wska¼nikiem null

source: statement name is a null pointer
pl: nazwa instrukcji jest wska¼nikiem null

source: function requires at least protocol version 3.0
pl: funkcja wymaga przynajmniej protoko³u w wersji 3.0

source: no connection to the server
pl: brak po³±czenia z serwerem

source: another command is already in progress
pl: inne polecenie jest aktualnie wykonywane

source: length must be given for binary parameter
pl: musi byæ podana d³ugo¶æ parametru binarnego

source: unexpected asyncStatus: %d
pl: nieoczekiwany asyncStatus: %d

source: PGEventProc "%s" failed during PGEVT_RESULTCREATE event
pl: PGEventProc "%s" zawiod³a podczas zdarzenia PGEVT_RESULTCREATE

source: COPY terminated by new PQexec
pl: KOPIOWANIE zakoñczone przez nowe PQexec

source: COPY IN state must be terminated first
pl: stan COPY IN musi zostaæ wcze¶niej zakoñczony

source: COPY OUT state must be terminated first
pl: stan COPY OUT musi zostaæ wcze¶niej zakoñczony

source: PQexec not allowed during COPY BOTH
pl: PQexec niedozwolone podczas COPY BOTH

source: no COPY in progress
pl: brak KOPIOWANIA w toku

source: connection in wrong state
pl: po³±czenie posiada b³êdny stan

source: invalid ExecStatusType code
pl: b³êdny kod ExecStatusType

source: column number %d is out of range 0..%d
pl: numer kolumny %d wykracza poza zakres 0..%d

source: row number %d is out of range 0..%d
pl: numer wiersza %d wykracza poza zakres 0..%d

source: parameter number %d is out of range 0..%d
pl: numer parametru %d wykracza poza zakres 0..%d

source: could not interpret result from server: %s
pl: nie mo¿na zinterpretowaæ wyników z serwera: %s

source: incomplete multibyte character
pl: niepe³ny znak wielobajtowy

source: cannot determine OID of function lo_truncate
pl: nie mo¿na ustaliæ OID funkcji lo_truncate

source: cannot determine OID of function lo_create
pl: nie mo¿na ustaliæ OID funkcji lo_create

source: could not open file "%s": %s
pl: nie mo¿na otworzyæ pliku "%s": %s

source: could not read from file "%s": %s
pl: nie mo¿na czytaæ z pliku "%s": %s

source: could not write to file "%s": %s
pl: nie mo¿na pisaæ do pliku "%s": %s

source: query to initialize large object functions did not return data
pl: zapytanie inicjuj±ce du¿y obiekt nie zwróci³o ¿adnych danych

source: cannot determine OID of function lo_open
pl: nie mo¿na ustaliæ OID funkcji lo_open

source: cannot determine OID of function lo_close
pl: nie mo¿na ustaliæ OID funkcji lo_close

source: cannot determine OID of function lo_creat
pl: nie mo¿na ustaliæ OID funkcji lo_creat

source: cannot determine OID of function lo_unlink
pl: nie mo¿na ustaliæ OID funkcji lo_unlink

source: cannot determine OID of function lo_lseek
pl: nie mo¿na ustaliæ OID funkcji lo_lseek

source: cannot determine OID of function lo_tell
pl: nie mo¿na ustaliæ OID funkcji lo_tell

source: cannot determine OID of function loread
pl: nie mo¿na ustaliæ OID funkcji loread

source: cannot determine OID of function lowrite
pl: nie mo¿na ustaliæ OID funkcji lowrite

source: integer of size %lu not supported by pqGetInt
pl: typ integer o rozmiarze %lu nie jest obs³ugiwany przez pqGetInt

source: integer of size %lu not supported by pqPutInt
pl: typ integer o rozmiarze %lu nie jest obs³ugiwany przez pqPutInt

source: connection not open
pl: po³±czenie nie jest otwarte

source: server closed the connection unexpectedly This probably means the server terminated abnormally before or while processing the request.
pl: serwer zamkn±³ po³±czenie niespodziewanie Oznacza to prawdopodobnie i¿ serwer zakoñczy³ dzia³anie niepoprawnie przed lub podczas przetwarzania zapytania.

source: timeout expired
pl: up³yn±³ limit czasu rz±dania

source: socket not open
pl: gniazdo nie jest otwarte

source: select() failed: %s
pl: select() nie uda³o siê: %s

source: invalid setenv state %c, probably indicative of memory corruption
pl: niepoprawny stan setenv %c, prawdopodobnie oznajmiaj±cy uszkodzenie pamiêci

source: invalid state %c, probably indicative of memory corruption
pl: niepoprawny stan %c, prawdopodobnie oznajmiaj±cy uszkodzenie pamiêci

source: message type 0x%02x arrived from server while idle
pl: otrzymano wiadomo¶æ typu 0x%02x z serwera podczas procesu bezczynno¶ci

source: unexpected character %c following empty query response ("I" message)
pl: nieznany znak %c nastêpuj±cy po odpowiedzi pustego zapytania (wiadomo¶æ "I")

source: server sent data ("D" message) without prior row description ("T" message)
pl: serwer wys³a³ dane (wiadomo¶æ "D") bez wcze¶niejszego opisu wiersza (wiadomo¶æ "T")

source: server sent binary data ("B" message) without prior row description ("T" message)
pl: serwer wys³a³ dane binarne (wiadomo¶æ "B") bez wcze¶niejszego opisu wiersza (wiadomo¶æ "T")

source: unexpected response from server; first received character was "%c"
pl: nieznana odpowied¼ z serwera: pierwszym znakiem otrzymanym by³ "%c"

source: out of memory for query result
pl: brak pamiêci dla rezultatów zapytania

source: lost synchronization with server, resetting connection
pl: utracono synchronizacjê z serwerem, resetujê po³±czenie

source: protocol error: id=0x%x
pl: b³±d protoko³u: id=0x%x

source: server sent data ("D" message) without prior row description ("T" message)
pl: serwer wys³a³ dane (wiadomo¶æ "D") bez wcze¶niejszego opisu wiersza (wiadomo¶æ "T")

source: message contents do not agree with length in message type "%c"
pl: zawarto¶æ wiadomo¶ci nie zgadza siê z d³ugo¶ci± wiadomo¶ci typu "%c"

source: lost synchronization with server: got message type "%c", length %d
pl: utracono synchronizacjê z serwerem: otrzymano wiadomo¶æ typu"%c", d³ugo¶æ %d

source: unexpected field count in "D" message
pl: nieznane pole wyliczone w wiadomo¶ci "D"

source: at character %s
pl: znak %s

source: DETAIL: %s
pl: SZCZEGÓ£Y: %s

source: HINT: %s
pl: PODPOWIED¬: %s

source: QUERY: %s
pl: ZAPYTANIE: %s

source: CONTEXT: %s
pl: KONTEKST: %s

source: LOCATION:
pl: LOKALIZACJA:

source: LINE %d:
pl: LINIA %d:

source: PQgetline: not doing text COPY OUT
pl: PQgetline: nie dzia³am aktualnie w stanie COPY OUT

source: could not establish SSL connection: %s
pl: nie mo¿na ustanowiæ po³±czenia SSL: %s

source: SSL SYSCALL error: %s
pl: b³±d SSL SYSCALL: %s

source: SSL SYSCALL error: EOF detected
pl: b³±d SSL SYSCALL: wykryto EOF

source: SSL error: %s
pl: b³±d SSL: %s

source: SSL connection has been closed unexpectedly
pl: Po³±czenie SSL zosta³o nieoczekiwanie zamkniête

source: unrecognized SSL error code: %d
pl: nieznany b³±d SSL o kodzie: %d

source: could not receive data from server: %s
pl: nie mo¿na otrzymaæ danych z serwera: %s

source: could not send data to server: %s
pl: nie mo¿na wys³aæ danych do serwera: %s

source: host name must be specified for a verified SSL connection
pl: nazwa hosta musi zostaæ podana dla zweryfikowanego po³±czenia SSL

source: server common name "%s" does not match host name "%s"
pl: nazwa zwyczajowa serwera "%s" nie odpowiada nazwie hosta "%s"

source: could not create SSL context: %s
pl: nie mo¿na utworzyæ kontekstu SSL: %s

source: could not open certificate file "%s": %s
pl: nie mo¿na otworzyæ pliku certyfikatu "%s": %s

source: could not read certificate file "%s": %s
pl: nie mo¿na odczytaæ pliku certyfikatu "%s": %s

source: could not load SSL engine "%s": %s
pl: nie mo¿na wczytaæ silnika SSL "%s": %s

source: could not initialize SSL engine "%s": %s
pl: nie mo¿na zainicjowaæ silnika SSL "%s": %s

source: could not read private SSL key "%s" from engine "%s": %s
pl: nie mo¿na odczytaæ prywatnego klucza SSL "%s" z silnika "%s": %s

source: could not load private SSL key "%s" from engine "%s": %s
pl: nie mo¿na pobraæ prywatnego klucza SSL "%s" z silnika "%s": %s

source: certificate present, but not private key file "%s"
pl: znaleziono certyfikat ale nie znaleziono pliku z prywatnym kluczem "%s"

source: private key file "%s" has group or world access; permissions should be u=rw (0600) or less
pl: plik has³a "%s" posiada globalne lub grupowe uprawnienia odczytu; uprawniania powinny byæ ustawione na u=rw (0600) lub ni¿ej

source: could not load private key file "%s": %s
pl: nie mo¿na pobraæ pliku z kluczem prywatnym "%s": %s

source: certificate does not match private key file "%s": %s
pl: certyfikat nie pokrywa siê z prywatnym kluczem w pliku "%s": %s

source: could not read root certificate file "%s": %s
pl: nie mo¿na odczytaæ pliku z certyfikatem u¿ytkownika root "%s": %s

source: SSL library does not support CRL certificates (file "%s")
pl: biblioteka SSL nie wspiera certyfikatów CRL (plik "%s")

source: could not get home directory to locate root certificate file Either provide the file or change sslmode to disable server certificate verification.
pl: nie mo¿na pobraæ folderu domowego aby zlokalizowaæ plik certyfikatu g³ównego Albo dostarcz plik albo zmieñ tryb ssl by zablokowaæ weryfikacjê certyfikatu serwera.

source: root certificate file "%s" does not exist Either provide the file or change sslmode to disable server certificate verification.
pl: plik certyfikatu g³ównego "%s" nie istnieje Albo dostarcz plik albo zmieñ tryb ssl by zablokowaæ weryfikacjê certyfikatu serwera.

source: certificate could not be obtained: %s
pl: certyfikat nie mo¿e zostaæ otrzymany: %s

source: SSL certificate's common name contains embedded null
pl: nazwa zwyczajowa certyfikatu SSL zawiera osadzony null

source: no SSL error reported
pl: nie zg³oszono b³êdu SSL

source: SSL error code %lu
pl: kod b³êdu SSL %lu
